#include <iostream>

using namespace std;

/*  @TODO
*   1. BinarySearchTree
*       • Базовые операции: вставка, поиск, удаление V
*       • Поиск элемента на вхождение V
*       • Поиск на вхождение поддерева V
*       • Поиск узла по заданному пути, поиск по относительному пути V
*       • Извлечение поддерева (по заданному элементу) V
*       • Балансировка
*       • Прошивка
*       • Слияние
*       • Высота дерева V
*       • Сохранение в строку в соответствии с заданным обходом
*       • Чтение из строки в соответствии с заданным обходом
*
*   2. Assert tests
*   3. Time tests
*/

int main() {
    cout << "Hello World";
    return 0;
}